VPro/src/Catalogs/AdditionalAttributesAndInformationSets/AdditionalAttributesAndInformationSets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AdditionalAttributesAndInformationSets</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Catalog_ProductsAndServices</name>
      <description>ProductsAndServices</description>
    </items>
    <items>
      <name>Catalog_Specifications</name>
      <description>Specifications</description>
    </items>
    <items>
      <name>Catalog_ProductsAndServicesCharacteristics</name>
      <description>Đặc tính mặt hàng</description>
    </items>
    <items>
      <name>Catalog_Banks</name>
      <description>Banks</description>
    </items>
    <items>
      <name>Document_ExpenseReport</name>
      <description>Авансовый отчет</description>
    </items>
    <items>
      <name>Document_AcceptanceCertificate</name>
      <description>Biên bản bàn giao công việc</description>
    </items>
    <items>
      <name>Catalog_ExternalUsers</name>
      <description>Người sử dụng ngoài</description>
    </items>
    <items>
      <name>Catalog_CounterpartyContracts</name>
      <description>Hợp đồng với đối tác</description>
    </items>
    <items>
      <name>Document_LoanContract</name>
      <description>Loan contract</description>
    </items>
    <items>
      <name>Document_LoanInterestCommissionAccruals</name>
      <description>Loan interest commission accruals</description>
    </items>
    <items>
      <name>Document_WorkOrder</name>
      <description>Giao việc</description>
    </items>
    <items>
      <name>Document_ProductionOrder</name>
      <description>Đơn hàng sản xuất</description>
    </items>
    <items>
      <name>Document_CustomerOrder</name>
      <description>Đơn hàng của khách</description>
    </items>
    <items>
      <name>Document_PurchaseOrder</name>
      <description>Đơn hàng đặt nhà cung cấp</description>
    </items>
    <items>
      <name>Document_CashOutflowPlan</name>
      <description>Giấy đề nghị thanh toán</description>
    </items>
    <items>
      <name>Catalog_FixedAssets</name>
      <description>Assets</description>
    </items>
    <items>
      <name>Catalog_ContactPersons</name>
      <description>Người liên hệ</description>
    </items>
    <items>
      <name>Catalog_Counterparties</name>
      <description>Đối tác</description>
    </items>
    <items>
      <name>Catalog_SuppliersProductsAndServices</name>
      <description>Mặt hàng nhà cung cấp</description>
    </items>
    <items>
      <name>Catalog_Companies</name>
      <description>Doanh nghiệp</description>
    </items>
    <items>
      <name>Catalog_FileFolders</name>
      <description>Thư mục tệp</description>
    </items>
    <items>
      <name>Catalog_ProductsAndServicesBatches</name>
      <description>Nhóm sản phẩm</description>
    </items>
    <items>
      <name>Document_InventoryTransfer</name>
      <description>Перемещение запасов</description>
    </items>
    <items>
      <name>Catalog_Users</name>
      <description>Người sử dụng</description>
    </items>
    <items>
      <name>Document_CashReceipt</name>
      <description>Thu tiền mặt</description>
    </items>
    <items>
      <name>Document_PaymentReceipt</name>
      <description>Thu vào tài khoản</description>
    </items>
    <items>
      <name>Document_SupplierInvoice</name>
      <description>Hóa đơn nhận hàng</description>
    </items>
    <items>
      <name>Document_GoodsReceipt</name>
      <description>Приходный ордер</description>
    </items>
    <items>
      <name>Document_InventoryAssembly</name>
      <description>Production</description>
    </items>
    <items>
      <name>Document_CashPayment</name>
      <description>Chi tiền mặt</description>
    </items>
    <items>
      <name>Document_PaymentExpense</name>
      <description>Chi từ tài khoản</description>
    </items>
    <items>
      <name>Document_CustomerInvoice</name>
      <description>Hóa đơn giao hàng</description>
    </items>
    <items>
      <name>Document_GoodsExpense</name>
      <description>Расходный ордер</description>
    </items>
    <items>
      <name>Document_JobSheet</name>
      <description>Сдельный наряд</description>
    </items>
    <items>
      <name>Document_Event</name>
      <description>Sự kiện</description>
    </items>
    <items>
      <name>Catalog_Employees</name>
      <description>Employees</description>
    </items>
    <items>
      <name>Document_InventoryWriteOff</name>
      <description>Списание запасов</description>
    </items>
    <items>
      <name>Catalog_CashFlowItems</name>
      <description>Dạng lưu chuyển tiền tệ</description>
    </items>
    <items>
      <name>Catalog_SerialNumbers</name>
      <description>Danh mục số sê-ri</description>
    </items>
    <items>
      <name>Catalog_StructuralUnits</name>
      <description>Cơ cấu tổ chức</description>
    </items>
    <items>
      <name>Document_InvoiceForPayment</name>
      <description>Hóa đơn thanh toán</description>
    </items>
    <items>
      <name>Document_SupplierInvoiceForPayment</name>
      <description>Hóa đơn thanh toán của nhà cung cấp</description>
    </items>
    <items>
      <name>Catalog_Vehicles</name>
      <description>Phương tiện vận tải</description>
    </items>
    <items>
      <name>Catalog_Files</name>
      <description>Tệp</description>
    </items>
    <items>
      <name>Catalog_Individuals</name>
      <description>Cá nhân</description>
    </items>
  </predefined>
  <attributes>
    <name>CountAttributes</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CountInformation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Used</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PredefinedSetName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>DeletionMark</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>PredefinedSetName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalInformation</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>DeletionMark</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>PredefinedSetName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Presentations</name>
    <attributes>
      <name>LanguageCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Catalogs/AdditionalAttributesAndInformationSets/Forms/GroupForm/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ReadOnly = True;
	
	SetPropertyTypes = PropertiesManagementService.SetPropertyTypes(Object.Ref);
	UseAdditAttributes = SetPropertyTypes.AdditionalAttributes;
	UseAdditInfo  = SetPropertyTypes.AdditionalInformation;
	
	If UseAdditAttributes And UseAdditInfo Then
		Title = Object.Description + " " + NStr("en='(Group of additional attribute and information sets)';ru='(Группа наборов дополнительных реквизитов и сведений)';vi='(Nhóm tập hợp mục tin và thông tin bổ sung)'")
		
	ElsIf UseAdditAttributes Then
		Title = Object.Description + " " + NStr("en='(Group of additional attribute sets)';ru='(Группа наборов дополнительных реквизитов)';vi='(Nhóm tập hợp mục tin bổ sung)'")
		
	ElsIf UseAdditInfo Then
		Title = Object.Description + " " + NStr("en='(Group of additional information sets)';ru='(Группа наборов дополнительных сведений)';vi='(Nhóm tập hợp thông tin bổ sung)'")
	EndIf;
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)

EndProcedure

#EndRegion
